Repository: 84000/data-translation-memory
Catalog: toh47-v3.tmx
Source language: bo
Languages: en

source: ཞི་བའི་བློ་གྲོས་རྒྱལ་པོ་ཡུལ་འཁོར་སྲུང་གིས་བཅོམ་ལྡན་འདས་ཡོན་ཏན་མཐའ་ཡས་རིན་ཆེན་སྣ་ཚོགས་བཀོད་པའི་རྒྱལ་པོ་དེ་བཞིན་གཤེགས་པ་དེ་ལ་དགེ་སློང་གི་དགེ་འདུན་དང་ཐབས་ཅིག་ཏུ་ལོ་བྱེ་བ་ཚང་བར་ཡིད་དུ་འོང་བའི་བཟའ་བ་དང་། བཏུང་བ་དང་། ན་བཟའ་དང་། གཙུག་ལག་ཁང་དང་། འཆག་སའི་ལོངས་སྤྱོད་ཀྱིས་བསྙེན་བཀུར་བྱས་ཏེ། དགེ་སློང་རེ་རེ་ལ་ཡང་རིམ་གྲོ་བྱ་བ་དང་སྤྱོད་པའི་ཕྱིར་གཡོག་གསུམ་གསུམ་ཕུལ་ལོ། །
en: “Śāntamati, for ten million years King Dhṛtarāṣṭra served that blessed realized one, King Arrangement of Manifold Precious Virtues Without End, and his monastic assembly with good food, drink, clothing, monasteries, and places for walking, and in order to provide support to each monk, each of them was offered the three sets of robes.

source: ཞི་བའི་བློ་གྲོས་རྒྱལ་བུ་གཞོན་ནུ་དེ་དག་ཀྱང་དེ་བཞིན་གཤེགས་པ་ལ་བསྟི་སྟང་བྱ་བ་དང་། མཆོད་པ་བྱ་བར་མོས་པ་དང་། ཆོས་མཉན་པ་དོན་དུ་གཉེར་བས་བག་ཡོད་པར་གྱུར་ཏེ། འདོད་པའི་ཡོན་ཏན་དོན་དུ་མི་གཉེར་རོ། །
en: “Śāntamati, the royal princes were also interested in honoring and venerating the Blessed One and out of dedication to hearing his teachings, they were conscientious and took no interest in sense pleasures.

source: དེ་དག་བག་ཡོད་ཅིང་དམ་པའི་ཆོས་ཉན་པ་དང་། སེམས་ཀྱིས་ངེས་པར་སེམས་པས་རིང་པོ་མ་ལོན་པར་མངོན་པར་ཤེས་པ་ལྔ་བསྐྱེད་པར་གྱུར་ཏོ། །
en: Because they were conscientious, listened to the true Dharma, and cultivated profound contemplation with their minds, in no time they acquired the five supernormal faculties.

source: དེ་དག་བསྐྱེད་ནས་སྟེང་གི་བར་སྣང་ལས་ངང་པའི་རྒྱལ་པོ་བཞིན་དུ་སྐྱེད་མོས་ཚལ་ནས་སྐྱེད་མོས་ཚལ་དང་། གྲོང་ཁྱེར་ནས་གྲོང་ཁྱེར་དང་། ཚོང་འདུས་ནས་ཚོང་འདུས་དང་།
en: As a result of acquiring them, they flew from park to park, from town to town, and from market town to market town throughout the entire four continents just like the king of swans soaring in the sky.

source: གླིང་བཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་དུ་མཐར་གྱིས་རྒྱུ་ཞིང་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ། །
en: They spoke the following verses:

source: སངས་རྒྱས་འབྱུང་བ་བརྒྱ་ལམ་རྙེད་པར་འགྱུར། །
en: “ ‘The arising of a buddha is a rare occurrence.

source: མིར་སྐྱེ་བ་ཡང་ཤིན་ཏུ་དཀའ་བ་རྙེད། །
en: This human life, too, is extremely hard to find.

source: གྲོགས་པོ་གང་དག་དད་དང་ཆོས་མཉན་པ། །
en: Such companions who have faith and listen to the Dharma

source: འདི་འདྲ་བསྐལ་པ་བརྒྱར་ཡང་རྙེད་པར་དཀའ། །
en: Are rarely met in this way even in a hundred eons.

source: མི་དབང་རྒྱལ་པོ་དེ་ནི་ད་བྱུང་སྟེ། །
en: “ ‘The king and lord of men has now come,

source: རབ་ཏུ་ཞི་བར་འགྲོ་བའི་ཆོས་སྟོན་གྱིས། །
en: Teaching a doctrine that leads to total peace.

source: བདེ་བར་གཤེགས་པ་དེ་ཡི་དྲུང་དུ་དེང་། །
en: Being in the presence of the Sublime One,

source: ཆོས་ཐོས་ནས་ནི་བདེ་འགྲོར་འགྲོ་བར་གྱིས། །
en: And hearing the Dharma, we go to the happy realms.

source: ཆོས་ཐོས་པས་ནི་ངན་འགྲོ་རྣམ་པར་སྤོང་། །
en: “By hearing the Dharma, one avoids the lower realms.

source: ཆོས་ཐོས་པས་ནི་བཟང་འགྲོར་འགྲོ་བར་འགྱུར། །
en: By hearing the Dharma, one goes to the favorable realms.

source: ཆོས་ཐོས་པས་ནི་ཉོན་མོངས་རྣམས་ཀྱང་ཞི། །
en: By hearing the Dharma, one also quells the afflictions,

source: བསིལ་བའི་དངོས་པོ་དམ་པ་ཐོབ་པར་འགྱུར། །
en: And one obtains the supreme state of being cooled down.’

source: དེ་དག་ཚིགས་བཅད་འདི་དག་རབ་བརྗོད་པས། །
en: “Once they had spoken these verses,

source: ས་འདི་རྣམ་པ་དྲུག་ཏུ་རབ་ཏུ་གཡོས། །
en: The earth trembled in six ways;

source: ལྷ་རྣམས་ཨ་ལ་ལ་ཞེས་ལན་བརྒྱ་སྨྲ། །
en: The gods exclaimed ‘ah la la!’ a hundred times,

source: ལྷ་ཡི་མེ་ཏོག་ཡིད་འོང་ཆར་དུ་བབ། །
en: And they rained down showers of pleasing divine flowers.

source: སྟོན་པ་བལྟ་ཕྱིར་གང་དག་བསྐུལ་བ་རྣམས། །
en: “Those who felt inspired went to see the Teacher,

source: རྐང་གཉིས་མཆོག་གི་ཞབས་ལ་ཕྱག་འཚལ་ནས། །དེ་དག་ཐལ་སྦྱར་གུས་བཅས་འཁོད་གྱུར་པ། །
en: And bowed at the feet of the supreme one among bipeds. They placed their palms together and sat down respectfully.

source: དེ་དག་བགྲང་བས་དཔག་པར་མི་ནུས་སོ། །
en: It was impossible to count how many people were there.

source: རྒྱལ་བས་དེ་དག་རྣམས་ཀྱི་བསམ་མཁྱེན་ནས། །
en: “The Victorious One knew each of their minds

source: དེ་དང་འཐུན་པའི་ཆོས་ནི་རབ་ཏུ་བཤད། །
en: And thus taught the Dharma appropriate to each of them.

source: བདེ་བར་གཤེགས་ལས་ཆོས་ཐོས་བྱེ་བ་ཕྲག །
en: Of those who heard the Dharma from the Sublime One,

source: སུམ་ཅུ་རྩ་དྲུག་བྱང་ཆུབ་མཆོག་ལ་ཞུགས། །
en: Three hundred sixty million sought supreme awakening.

source: བྱེ་བ་བརྒྱ་ཕྲག་གསུམ་ཚང་མི་ཉུང་བ། །
en: “No fewer than three billion of them

source: དེ་དག་ཆོས་མཆོག་མིག་ནི་རྣམ་པར་དག །
en: Purified the supreme Dharma eye,

source: སྲིད་པར་ཀུན་ཏུ་ཡིད་བྱུང་སེམས་གྱུར་ནས། །
en: Turned their minds away from saṃsāra,

source: དེ་དག་དེར་ནི་བསྟན་འདིར་རབ་ཏུ་བྱུང་། །
en: And went forth in this dispensation right then and there.

source: གཞན་ཡང་བྱེ་བ་ཁྲག་ཁྲིག་དེ་ཉིད་དུ། །
en: “Trillions of other beings undertook trainings

source: བསླབ་པ་བཟུང་ཞིང་དེ་བཞིན་གསོ་སྦྱོང་བླངས། །
en: And similarly took up vows.

source: སྟོན་ལ་མཆོད་པ་བྱས་ཤིང་ཆོས་མཉན་ནས། །
en: They worshiped the Teacher, heard his teachings,

source: དེ་དག་སླར་ཡང་རང་གི་གནས་སུ་དོང་། །
en: And then returned to their respective dwelling places.

source: ཞི་བའི་བློ་གྲོས་དེ་ལྟར་རྒྱལ་བུ་གཞོན་ནུ་དེ་དག་གིས་ཕ་ཡུལ་འཁོར་སྲུང་ལ་མཆོད་པའི་ལས་ཀྱི་ཕྱིར་ལྷའི་ཙན་དན་སྦྲུལ་གྱི་སྙིང་པོའི་ཁང་པ་བརྩེགས་པ་རྒྱ་ཆེ་ཞིང་ཡངས་པ། བཀོད་པས་ལེགས་པར་བརྒྱན་པ། བ་གམ་དང་། རྣམ་པར་རྒྱལ་བའི་བ་དན་དང་།
en: “Śāntamati, in order to show their love for their father, King Dhṛtarāṣṭra, the royal princes built a vast and expansive pavilion made of the divine sandalwood known as ‘serpent’s essence.’ It was well designed with fine features, and complete with pinnacles, victory banners, and arches.

source: རྟ་བབས་དང་། ཁ་ཁྱེར་གྱིས་བསྐོར་བ་ཞིག་བྱས་ཏེ་འཛམ་བུའི་གླིང་རིལ་གྱིས་ཀྱང་ཙན་དན་སྦྲུལ་གྱི་སྙིང་པོ་སྲང་ཕྱེད་ཀྱི་རིན་དུ་མི་ཆོག་པ་དེ་ལྟ་བུའི་ཙན་དན་སྦྲུལ་གྱི་སྙིང་པོའི་ཁང་པ་བརྩེགས་པ་རྒྱ་ཆེ་ཞིང་ཡངས་པ།
en: Its value was greater than that of all the remaining serpent’s essence sandalwood in the world put together.

source: ཆུ་ཞེང་དུ་དཔག་ཚད་བཅུ་ཡོད་པ།
en: This vast and expansive pavilion made of sandalwood measured ten square leagues.

source: རྣམ་པར་བཀྲ་བ། བལྟ་ན་སྡུག་པ། ཀ་བ་བཞི་ཟུག་པ། ཆ་མཉམ་པ། ཤིན་ཏུ་རྣམ་པར་ཕྱེ་བ་ཞིག་བྱས་པར་གྱུར་ཏོ། །
en: It was multicolored, beautiful to behold, supported by four columns, symmetrical, and well proportioned.

source: དེ་ནས་རྒྱལ་པོ་ཡུལ་འཁོར་སྲུང་དེ་ནམ་བཅོམ་ལྡན་འདས་དེ་ལ་བལྟ་བ་དང་། ཕྱག་བྱ་བ་དང་། མཆོད་པ་བྱ་བ་དང་། བསྙེན་བཀུར་བྱ་བ་དང་། ཆོས་མཉན་པའི་ཕྱིར་འགྲོ་བར་འདོད་པ་དེའི་ཚེ་ཕ་རྒྱལ་པོ་ཡུལ་འཁོར་སྲུང་དང་།
en: “Then, at that time, King Dhṛtarāṣṭra wished to go see the Blessed One, to honor him, to worship him, to serve him, and to hear the Dharma.

source: རྒྱལ་བུ་གཞོན་ནུ་དེ་རྣམས་དང་། བཙུན་མོའི་འཁོར་དང་། གཡོག་དང་བཅས་པ་དང་། གཉེན་གྱི་འཁོར་དང་བཅས་ཏེ་ཁང་པ་བརྩེགས་པ་དེར་ཞུགས་ནས། པད་མ་བཀོད་པའི་སེང་གེའི་ཁྲི་ལ་འདུག་སྟེ། བླ་མར་བྱ་བ་ཆེན་པོ་དང་། བསྟི་སྟང་དང་། རི་མོར་བྱ་བ་དང་། མེ་ཏོག་དང་། ཕྲེང་བ་དང་། སྤོས་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། གོས་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་། རྣམ་པར་རྒྱལ་བའི་བ་དན་དང་། སིལ་སྙན་དང་།
en: So, the king, the royal princes, the women from his household, his servants, and the group of his relatives all entered the pavilion and took a seat on lion’s seats arrayed with lotus flowers and honored, worshiped, and paid great respect to the Blessed One with the most excellent offerings of flowers, garlands, incense, scented oils, powders, clothes, parasols, victory banners, silk hangings, flags of victory, and the melodious sounds of cymbals, drums, and other instruments, and they covered the pavilion with jeweled nets.

source: ཕེག་རྡོབ་པ་དང་། རོལ་མོའི་སྒྲ་དབྱངས་ལེན་པའི་མཆོད་པ་དམ་པ་དང་ཆས་ནས་ཁང་པ་བརྩེགས་པ་དེ་རིན་པོ་ཆེའི་དྲ་བས་རབ་ཏུ་གཡོགས་ཏེ། ཐམས་ཅད་དང་ལྷན་ཅིག་ཏུ་འདུས་ནས་ཁང་པ་བརྩེགས་པ་དེ་སྤྲུལ་ཏེ།
en: When everything had been brought together, the pavilion looked like a heap of jewels.

source: སྟེང་གི་ནམ་མཁའ་བར་སྣང་ལ་ངང་པའི་རྒྱལ་པོ་ལྟར་ཐོགས་པ་མེད་པར་བཅོམ་ལྡན་འདས་ཡོན་ཏན་མཐའ་ཡས་རིན་ཆེན་སྣ་ཚོགས་བཀོད་པའི་རྒྱལ་པོ་དེ་བཞིན་གཤེགས་པ་ག་ལ་བ་དེར་དོང་ནས་ཕྱིན་པ་དང་ཁང་པ་བརྩེགས་པ་དེ་ས་ལ་བཞག་སྟེ།
en: It then immediately rose into the sky and flew like the king of swans to where the realized one, the blessed King Arrangement of Manifold Precious Virtues Without End, was dwelling, and it settled on the ground there.

source: བཅོམ་ལྡན་འདས་དེའི་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས་དགེ་སློང་གི་དགེ་འདུན་ལ་ཡང་ཕྱག་འཚལ་ཏེ།
en: “The king and the princes bowed down at the feet of the Blessed One, and then bowed down to the monastic assembly.

source: ལན་བདུན་བསྐོར་བ་བྱས་ནས་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ། །
en: They walked around them seven times, keeping them on the right, and sat down to one side.

source: རྒྱལ་པོ་ཡུལ་འཁོར་སྲུང་གི་བཙུན་མོའི་འཁོར་དང་། གཉེན་གྱི་འཁོར་ཀྱང་ཁང་པ་བརྩེགས་པ་དེ་ལས་བབས་ནས་བཅོམ་ལྡན་འདས་དེའི་ཞབས་གཉིས་དང་། དགེ་སློང་གི་དགེ་འདུན་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་ལན་བདུན་བསྐོར་བ་བྱས་ནས་ཆོས་མཉན་པའི་ཕྱིར་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་བཙུན་མོའི་འཁོར་དང་།
en: Then the retinue of King Dhṛtarāṣṭra’s wives and his relatives likewise descended from the pavilion and bowed down to the Blessed One and the monastic assembly, and walked around them seven times, keeping them on the right.

source: གཉེན་གྱི་འཁོར་དུ་བཅས་ཏེ་འདུག་གོ །
en: The women and the relatives then sat to one side in the Blessed One’s presence in order to hear the Dharma.

source: བམ་པོ་གསུམ་པ། དེ་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་མཐའ་ཡས་རིན་ཆེན་སྣ་ཚོགས་བཀོད་པའི་རྒྱལ་པོས་རྒྱལ་པོ་ཡུལ་འཁོར་སྲུང་ཆོས་མཉན་པའི་ཕྱིར་འོངས་པར་མཁྱེན་ནས་ཆོས་ཀྱི་གཏམ་གྱིས་ཡང་དག་པར་བསྟན། ཡང་དག་པར་འཛིན་དུ་བཅུག །ཡང་དག་པར་གཟེངས་སྟོད།
en: “The blessed realized one, King Arrangement of Manifold Precious Virtues Without End, knew that King Dhṛtarāṣṭra had come to hear the Dharma from him.

source: ཡང་དག་པར་དགའ་བར་མཛད་དོ། །
en: So, he gave him a telling of the Dharma that captivated and uplifted him, and brought him joy.

source: དེ་ལ་བཅོམ་ལྡན་འདས་དེའི་ཆོས་ཀྱི་གཏམ་ནི་འདི་ཡིན་ཏེ།
en: This is the telling of the Dharma that the Blessed One gave him:

source: རྒྱལ་པོ་ཆེན་པོ་ཆོས་བཞི་པོ་འདི་དག་ནི་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པ་རྣམས་ཡོངས་སུ་མི་ཉམས་ཤིང་ཁྱད་པར་དུ་འགྲོ་བར་འགྱུར་བའོ། །
en: “ ‘Great King, those who are firmly established in the Great Vehicle achieve excellence in four qualities, and do not allow them to perish.

source: བཞི་གང་ཞེ་ན།
en: What are these four?

source: རྒྱལ་པོ་ཆེན་པོ་དད་པ་ནི་ཡོངས་སུ་མི་ཉམས་ཤིང་ཁྱད་པར་དུ་འགྲོ་བར་འགྱུར་བའོ། །
en: Great King, they achieve excellence in faith, and do not allow it to perish.

source: དད་པ་དེ་གང་ཞེ་ན།
en: What kind of faith is this?

source: དད་པ་གང་གིས་འཕགས་པའི་དྲུང་དུ་ཉེ་བར་འགྲོ་བ་དང་བྱ་བ་མ་ཡིན་པ་མི་བྱེད་པའོ། །
en: It is a faith that brings them closer to the noble ones and restrains them from doing deeds that should not be done.

source: རྒྱལ་པོ་ཆེན་པོ་གུས་པ་ནི་ཁྱད་པར་དུ་འགྲོ་བར་འགྱུར་བ་སྟེ།
en: Great King, they achieve excellence in devotion.

source: གུས་པ་གང་གིས་འཕགས་པ་རྣམས་ཀྱི་ལེགས་པར་བཤད་པ་རྣམས་གུས་པར་ཉན་པ་དང་། རྣབ་བླགས་ཏེ་ཆོས་ཉན་པའོ། །
en: With such devotion, they listen well to the well-spoken words of noble ones and they listen attentively to the Dharma.

source: རྒྱལ་པོ་ཆེན་པོ་ང་རྒྱལ་མེད་པ་ནི་ཁྱད་པར་དུ་འགྲོ་བར་འགྱུར་བ་སྟེ།
en: Great King, they achieve excellence in humility.

source: ང་རྒྱལ་མེད་པ་གང་གིས་འཕགས་པ་རྣམས་ལ་མངོན་པར་འདུད་པ་དང་། རབ་ཏུ་འདུད་པ་དང་། ཕྱག་འཚལ་བའོ། །
en: With such humility they bow, bend, and kneel to noble ones.

source: རྒྱལ་པོ་ཆེན་པོ་བརྩོན་འགྲུས་ནི་ཁྱད་པར་དུ་འགྲོ་བར་འགྱུར་བ་སྟེ་བརྩོན་འགྲུས་གང་གིས་ལུས་ཡང་བ་དང་།
en: Great King, they achieve excellence in heroic effort.

source: སེམས་ཡང་བ་འཐོབ་པ་དང་། བྱ་བ་ཐམས་ཅད་ཀྱང་ཉམས་འོག་ཏུ་ཆུད་པར་བྱེད་པ་སྟེ།
en: With such heroic effort they acquire agility of body and agility of mind and they complete everything they have to do.

source: རྒྱལ་པོ་ཆེན་པོ་ཆོས་བཞི་པོ་དེ་དག་ནི་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པ་རྣམས་ཡོངས་སུ་མི་ཉམས་ཤིང་ཁྱད་པར་དུ་འགྲོ་བར་འགྱུར་བའོ། །
en: Great King, those who are firmly established in the Great Vehicle achieve excellence in these four qualities and do not allow them to perish.

source: རྒྱལ་པོ་ཆེན་པོ་ཆོས་བཞི་པོ་འདི་དག་ནི་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པ་རྣམས་འགྱོད་པ་མེད་པ་དང་། བག་ཡོད་པ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་བའོ། །
en: “ ‘Great King, those who are firmly established in the Great Vehicle work with vigilance to perfect four qualities, and thus they have no regrets.

source: དབང་པོ་སྡོམ་པ་དང་།
en: They control the senses;

source: འདོད་པ་རྣམས་ལ་སྐྱོན་དུ་ལྟ་བ་དང་།
en: they see the flaws in sense pleasures;

source: ཡོངས་སུ་འཛིན་པ་ཐམས་ཅད་ལ་མི་རྟག་པའི་འདུ་ཤེས་དང་།
en: they understand that everything subject to clinging is impermanent;

source: ཆོས་ལ་ངེས་པར་སེམས་པ་ནི་སྲོག་གི་དབང་པོའི་དམ་པ་སྟེ། །
en: and they make the special contemplation of the Dharma the greatest motivating factor of their lives.

source: རྒྱལ་པོ་ཆེན་པོ་ཆོས་བཞི་པོ་དེ་དག་ནི་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པ་རྣམས་འགྱོད་པ་མེད་པ་དང་། བག་ཡོད་པ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་བའོ། །
en: Great King, those who are firmly established in the Great Vehicle work with vigilance to perfect these four qualities, and thus they have no regrets.

source: རྒྱལ་པོ་ཆེན་པོ་ཆོས་བཞི་དང་ལྡན་ན་རྒྱལ་པོ་ལ་ཆོས་ཀྱི་རྒྱལ་པོ་ཞེས་བྱ་སྟེ།
en: “ ‘Great King, when a king possesses four qualities, he is called a king of the Dharma.

source: བྱང་ཆུབ་ཀྱི་སེམས་རྗེས་སུ་མི་གཏོང་བ་དང་།
en: He never loses sight of his aspiration for awakening;

source: གཞན་དག་ཀྱང་བྱང་ཆུབ་ལ་ཡང་དག་པར་འཛུད་པ་དང་དགེ་བའི་རྩ་བ་ཐམས་ཅད་བྱང་ཆུབ་ཏུ་སྔོ་བ་དང་།
en: he inspires others to seek awakening; he dedicates all the roots of merit to awakening;

source: སངས་རྒྱས་ཀྱི་ཆེ་བ་ཉིད་མཐོང་ངམ་ཐོས་ན་སངས་རྒྱས་ཀྱི་ཆེ་བ་ཉིད་ལ་མོས་པ་མ་གཏོགས་པར་ལྷ་དང་། མི་དང་། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཆེ་བ་ཉིད་ལ་མངོན་པར་དགའ་བ་མ་ཡིན་པ་སྟེ།
en: and he has confidence in the greatness of the buddhas upon seeing and hearing about the greatness of the buddhas, while he does not feel anything special about the greatness of gods, humans, disciples, or solitary buddhas.

source: རྒྱལ་པོ་ཆེན་པོ་ཆོས་བཞི་པོ་དེ་དག་དང་ལྡན་ན་རྒྱལ་པོ་ལ་ཆོས་ཀྱི་རྒྱལ་པོ་ཞེས་བྱའོ། །
en: Great King, when a king possesses these four qualities, he is called a king of the Dharma.

source: རྒྱལ་པོ་ཆེན་པོ་དེ་ལྟ་བས་ན་ཁྱོད་རྟག་པར་བག་ཡོད་པར་བྱ་བ་དང་། དད་པ་དང་དང་བ་མང་བ་དང་། ཆོས་དོན་དུ་གཉེར་བ་དང་། ཆོས་ཀྱི་ཀུན་དགའ་ལ་དགའ་བ་དང་མོས་པར་བྱའོ། །
en: “ ‘Therefore, Great King, you should always be conscientious, faithful, clear minded, and a seeker of the Dharma, and you should have a firm conviction and find joy in the complete joy of the Dharma.

source: ཁྱོད་ཆོས་ཡོངས་སུ་བཙལ་བ་ལ་བརྩོན་པ་དང་། ཆོས་འདོད་པར་བྱའི་ཡུལ་ལ་ཆགས་པར་མི་བྱའོ། །
en: You should endeavor to seek out the Dharma, but you should not grow attached to the Dharma as an object of desire.

source: རྒྱལ་པོ་ཆེན་པོ་འདོད་པ་རྣམས་ལ་ཆོག་པ་མེད་པའི་ཕྱིར་ཏེ།
en: Great King, it is because desires are insatiable.

source: གང་དག་འཕགས་པའི་ཤེས་རབ་ཀྱིས་ངོམས་པ་དེ་དག་ནི་ངོམས་པའོ། །
en: Yet, those who find satisfaction through the wisdom of the noble ones are satisfied.

source: རྒྱལ་པོ་ཆེན་པོ་མི་རྣམས་ཀྱི་སྲོག་ནི་ཐུང་བ་ཚེའི་ཚད་ཀྱང་ཐུང་བ་སྟེ།
en: “ ‘Great King, the vital force of human beings is weak and the human lifespan is short.

source: ཚེ་རབས་འཕོ་བར་འགྲོ་བ་ཡིན་གྱིས།
en: Humans undergo a succession of lifetimes.

source: ཁྱོད་འཇིག་རྟེན་ཕ་རོལ་ལ་འཇིགས་པར་བལྟ་བར་བྱའོ། །
en: For these reasons, you should look with fear toward the world that comes after this one.

source: རྒྱལ་པོ་ཆེན་པོ་ཁྱོད་ཀྱིས་གང་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པ་དང་། རིམ་གྲོ་བྱས་པའི་དགེ་བའི་རྩ་བ་དེ་ཁྱོད་ཀྱིས་ཡོངས་སུ་བསྔོ་བ་བཞིས་ཡོངས་སུ་བསྔོ་བར་བྱའོ། །
en: Great King, any roots of virtue that you grow by worshiping and serving the realized ones should be dedicated according to four dedications.

source: ལོངས་སྤྱོད་མི་ཟད་པ་དང་། ཆོས་མི་ཟད་པ་དང་། སྤོབས་པ་མི་ཟད་པ་དང་།
en: They are inexhaustible riches, the inexhaustible Dharma, inexhaustible inspired eloquence, and inexhaustible knowledge.

source: ཡེ་ཤེས་མི་ཟད་པ་སྟེ་བཞི་པོ་དེ་དག་གོ །གཞན་ཡང་བཞི་སྟེ།
en: “ ‘There are another four.

source: ཚུལ་ཁྲིམས་ཀྱི་ཚོགས་ཀྱིས་ལུས་ཡོངས་སུ་དག་པ་དང་། ཐོས་པའི་ཚོགས་ཀྱིས་ངག་ཡོངས་སུ་དག་པ་དང་། ཤེས་རབ་ཀྱི་ཚོགས་ཀྱིས་སེམས་ཡོངས་སུ་དག་པ་དང་། ཡེ་ཤེས་ཀྱི་ཚོགས་ཀྱིས་ཤེས་རབ་ཡོངས་སུ་དག་པ་སྟེ་བཞི་པོ་དེ་དག་གོ །
en: They are the purity of the body that comes from the accumulation of moral conduct, the purity of speech that comes from the accumulation of learning, the purity of the mind that comes from the accumulation of wisdom, and the purity of wisdom that comes from the accumulation of knowledge.

source: གཞན་ཡང་བཞི་སྟེ། །
en: “ ‘There are another four.

source: སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པས་ཐབས་ཡོངས་སུ་རྫོགས་པ་དང་། བདུད་ཚར་གཅོད་པས་ཤེས་རབ་ཡོངས་སུ་རྫོགས་པ་དང་། ཇི་སྐད་སྨྲས་པ་དེ་བཞིན་བྱེད་པས་སྨོན་ལམ་ཡོངས་སུ་རྫོགས་པ་དང་། སངས་རྒྱས་མཐོང་བ་དང་ཕྲད་པས་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པའོ། །
en: They are the perfection of skill in means that comes from bringing beings to maturity, the perfection of wisdom that comes from defeating Māra in all his forms, the perfection of the bodhisattva vow that comes from doing what one has promised to do, and the perfection of all the qualities of the buddha that comes from seeing and meeting the buddhas.’

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་རྒྱལ་པོ་ཡུལ་འཁོར་སྲུང་ལ་ཆོས་ཀྱི་གཏམ་དེས་ཡང་དག་པར་བསྟན། ཡང་དག་པར་འཛིན་དུ་བཅུག །ཡང་དག་པར་གཟེངས་སྟོད། ཡང་དག་པར་དགའ་བར་མཛད་པས་ཚིམ་ཞིང་མགུ་ལ་ཡི་རངས་ཏེ།
en: “In this way, the Blessed One gave a thorough telling of the Dharma to King Dhṛtarāṣṭra, which thoroughly inspired him, uplifted him, and made him happy.

source: རབ་ཏུ་དགའ་ནས་དགའ་བ་དང་། ཡིད་བདེ་བ་སྐྱེས་ཏེ།
en: Thus the king was satisfied, overjoyed, pleased, and glad, and he felt both delight and cheerfulness of mind.

source: རིན་ཐང་མེད་པའི་མུ་ཏིག་གི་དོ་ཤལ་གྱིས་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པ་བྱས་སོ། །
en: He worshiped the Realized One by offering him a priceless pearl necklace.

source: ཡོངས་སུ་ལོངས་སྤྱད་པར་བྱ་བའི་ཕྱིར་རྒྱལ་སྲིད་ཐམས་ཅད་ཀྱང་བཅོམ་ལྡན་འདས་དེ་ལ་ཕུལ་ལོ། །ཇི་སྲིད་འཚོའི་བར་དུ་ལྔ་པ་ཚངས་པར་སྤྱོད་པ་དང་། བསླབ་པའི་གཞི་རྣམས་མནོས་སོ། །
en: He offered his entire kingdom to the Blessed One for his use, and he made the commitment to observe the five precepts, including the basic trainings and chastity, for as long as he lived.

source: བཙུན་མོའི་འཁོར་དེ་ཐམས་ཅད་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པར་གྱུར་ཏོ། །
en: “The women from the king’s inner chambers all conceived the aspiration for unsurpassable and perfect awakening.

source: ལྔ་པ་ཚངས་པར་སྤྱོད་པ་དང་། བསླབ་པའི་གཞི་རྣམས་ཀྱང་མནོས་སོ། །
en: They pledged to observe the five precepts, including the practice of celibacy and the other basic trainings.

source: རྒྱལ་པོའི་བཙུན་མོའི་འཁོར་ཀྱང་བཅོམ་ལྡན་འདས་ལས་ཆོས་ཀྱི་གཏམ་ཐོས་ནས་ཚིམ་ཞིང་མགུ་ལ་ཡི་རངས་ཏེ། རབ་ཏུ་དགའ་ནས་དགའ་བ་དང་། ཡིད་བདེ་བ་སྐྱེས་ཏེ།
en: When the women from the king’s inner chambers heard the Blessed One’s telling of the Dharma, the women were satisfied, overjoyed, pleased, and glad, and they felt both delight and cheerfulness of mind.

source: གོས་དང་རྒྱན་ཅི་ཐོགས་པ་རྣམས་བཅོམ་ལྡན་འདས་ཀྱི་སྐུ་ལ་མངོན་པར་གསོལ་བར་གྱུར་ཏོ། །
en: They took all their clothing and jewelry and put it on the body of the Blessed One.

source: མངོན་པར་གསོལ་ནས་ཀྱང་ཇི་སྲིད་འཚོའི་བར་དུ་ལྔ་པ་ཚངས་པར་སྤྱོད་པ་དང་བསླབ་པའི་གཞི་རྣམས་མནོས་སོ། །
en: Having offered all this, they also committed to observing the five precepts, including the basic trainings and chastity, for as long as they lived.

source: ཞི་བའི་བློ་གྲོས་དེ་ལྟར་རྒྱལ་པོ་ཡུལ་འཁོར་སྲུང་ཆོས་ཀྱི་རྙེད་པ་ཕུན་སུམ་ཚོགས་པས་རྙེད་པ་ཆེན་པོ་དང་ལྡན་ནས་བཙུན་མོའི་འཁོར་དང་བཅས། གཉེན་གྱི་འཁོར་དང་བཅས་ཤིང་འཁོར་དང་བཅས་ཏེ། བཅོམ་ལྡན་འདས་དེའི་ཞབས་གཉིས་དང་། དགེ་སློང་གི་དགེ་འདུན་གྱི་རྐང་པ་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས་ལན་གསུམ་བསྐོར་བ་བྱས་ཏེ།
en: “In this way, Śāntamati, King Dhṛtarāṣṭra become endowed with the treasure of the Dharma and, having acquired this great treasure, he, his wives, his relatives, and his entire retinue bowed their heads at the feet of the Blessed One, bowed to the monastic assembly, and walked around them three times, keeping them on the right.

source: སྟེང་གི་བར་སྣང་གི་ནམ་མཁའ་ལས་ཁང་པ་བརྩེགས་པ་དེ་ཉིད་ནས་རྒྱལ་པོའི་ཕོ་བྲང་རྣམ་པར་དག་པ་ཅན་དུ་སླར་འཁོར་ནས་རང་གི་ཁྱིམ་དུ་ཕྱིན་ཏོ། །
en: Then the whole pavilion rose into the air and returned to the king’s palace, Abode of Purity, and everyone went to their homes.

source: ཞི་བའི་བློ་གྲོས་དེ་ནས་རྒྱལ་པོ་ཡུལ་འཁོར་སྲུང་དུས་གཞན་ཞིག་ན་ཟླ་བ་ཉ་བའི་ཚེ་མེ་ཏོག་སྣ་ཚོགས་ཞེས་བྱ་བའི་སྐྱེད་མོས་ཚལ་གྱི་ས་བཟང་པོ་བལྟ་བའི་ཕྱིར་སོང་ནས།
en: “Furthermore, Śāntamati, there was another occasion during a full moon when King Dhṛtarāṣṭra decided to visit a pleasant spot in the park called Diverse Flowers.

source: དེ་སྐྱེད་མོས་ཚལ་ཆེན་པོ་དེ་ན་གནས་ཤིང་སིལ་སྙན་དང་། ཕེག་རྡོབ་པ་དང་། རོལ་མོའི་སྒྲ་རབ་ཏུ་ལེན་པ་དང་། རྩེ་བའི་དམ་པས་རྩེ་དགའ་ཞིང་དགའ་མགུར་སྤྱོད་དོ། །
en: While he was in that great garden, he had music played with cymbals, drums, and other musical instruments, and he had a feast and enjoyed himself.

source: ཆུང་མ་དམ་པ་མ་སྨད་པ་ཞེས་བྱ་བ་དང་། དཔེ་མེད་མ་ཞེས་བྱ་བ་དེ་གཉིས་རྫིང་དགའ་བ་ཞེས་བྱ་བར་ཁྲུས་བྱས་ཏེ་སྤོས་ཆུས་གོས་བརླན་ནས་སེང་གེའི་ཁྲི་པད་མའི་འབྱུང་གནས་བཟང་པོ་ལ་འདུག་གོ །
en: His perfect wives, who were named Aninditā and Anupamā, bathed in the pond called Joy and washed their clothes with the scented water. Then they sat down happily on lion’s seats next to the pond covered with lotuses.

source: དེ་གཉིས་དེར་འདུག་པའི་པང་པ་ནས་རྒྱལ་བུ་གཞོན་ནུ་གཟུགས་བཟང་བ།
en: As they sat there, two baby boys miraculously arose on their laps.

source: མཛེས་པ། བལྟ་ན་སྡུག་པ། ཁ་དོག་བཟང་པོ་རྒྱས་པ། མཆོག་དང་ལྡན་པ་གཉིས་སྐྱིལ་མོ་ཀྲུང་བཅས་པར་རྫུས་ཏེ་བྱུང་ངོ་། །
en: The beautiful, charming, lovely, well-complexioned young boys sat there with their legs crossed.

source: དེ་ནས་སྐད་ཅིག་དེ་ཉིད་ལ་སྟེང་གི་བར་སྣང་ལས་ལྷ་རྣམས་ཀྱིས་ཀྱེ་མ་ཁྱེའུ་འདི་ནི་ཆོས་སེམས་པའོ། །ཀྱེ་མ་ཁྱེའུ་འདི་ནི་ཆོས་ཀྱི་བློ་གྲོས་སོ་ཞེས་སྒྲ་བྱུང་ངོ་། །ཞི་བའི་བློ་གྲོས་དེ་ལྟར་འཇིག་རྟེན་དུ་ཁྱེའུ་དེ་གཉིས་ཆོས་སེམས་པ་དང་། ཆོས་ཀྱི་བློ་གྲོས་ཞེས་བྱ་བའི་མིང་དུ་གྱུར་ཏོ། །
en: In that instant, the gods in the sky above them cried out, ‘Oh, this boy is Dharmacinti!’ and ‘Oh, this boy is Dharmamati!’ Thus, Śāntamati, the boys became known as Dharmacinti and Dharmamati throughout the land.

source: དེ་ལ་ཁྱེའུ་ཆོས་སེམས་པ་ནི་བཙུན་མོ་མ་སྨད་པའི་པང་པ་ནས་བྱུང་ངོ་། །ཆོས་ཀྱི་བློ་གྲོས་ནི་བཙུན་མོ་དཔེ་མེད་མའི་བང་པ་ནས་བྱུང་ངོ་། །
en: The boy Dharmacinti arose on the lap of Queen Aninditā, and the boy Dharmamati on the lap of Queen Anupamā.

source: ཁྱེའུ་དེ་གཉིས་བྱུང་མ་ཐག་ཏུ་སྐྱིལ་མོ་ཀྲུང་མ་ཉམས་པར་གཉིས་ཀས་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ། །
en: At the moment of their births, as they were sitting there cross-legged the two boys spoke the following verses:

source: གང་དག་བྱང་ཆུབ་ཏུ་ནི་སེམས་སྐྱེད་ཅིང་། །
en: “ ‘Those who make the aspiration for awakening,

source: འཇིག་རྟེན་མགོན་པོ་ཡུལ་དུ་བྱུང་བ་ལ། །
en: And with minds full of serene faith

source: རབ་ཏུ་དང་བའི་སེམས་ཀྱིས་ཕྱག་འཚལ་བ། །
en: Pay homage to the lokapālas,

source: དེ་དག་རྙེད་པ་རབ་རྙེད་གྲོགས་པོ་དག །
en: Friends, they gain the greatest treasure.

source: གང་ཞིག་བྱང་ཆུབ་སེམས་ནི་མ་བརྗེད་པ། །
en: “ ‘Those who do not forget the aspiration for awakening

source: དེ་ནི་སྲིད་པའི་རྒྱ་མཚོའི་གཏིང་ནས་ཕྱིན། །
en: Rise from the depths of the ocean of existence,

source: འཁོར་བའི་འཁོར་ལོ་ལས་ནི་ཡིད་ཀྱང་ལོག །
en: Their very minds turn away from the wheel of saṃsāra,

source: སེམས་ཅན་རྒྱ་ཆེན་རྣམས་ཀྱིས་ལེགས་པར་གཟུང་། །
en: And they are held dear by vast numbers of beings.

source: སྟེང་གི་ཕྱོགས་ན་ཡན་ལག་མ་སྨད་པ། །
en: “ ‘Above us is a perfect, peerless guide

source: འདྲེན་པ་མཚན་ནི་དུས་དཔོག་རྒྱལ་པོ་སྟེ། །
en: Who is known as the king of sages.

source: དེ་ནས་བདག་ཅག་ཆོས་དོན་གཉེར་བ་དང་། །
en: And so, seeking the Dharma, we came

source: འཇིག་མགོན་ཡོན་ཏན་འབྱུང་གནས་བལྟ་ཕྱིར་མཆིས། །
en: To see this refuge from destruction, this mine of virtues.’

source: ཁྱེའུ་དེ་གཉིས་ཀྱིས་སྐྱིལ་མོ་ཀྲུང་བཤིག་ནས། །
en: “The two boys unfolded their legs,

source: དེ་ཡི་ཚེ་ནམ་ཡི་པང་ནས་བབས། །
en: Climbed down from their mothers’ laps,

source: ཡུལ་འཁོར་སྲུང་པོ་ག་ལར་དེ་གཉིས་དོང་། །
en: And went to see King Dhṛtarāṣṭra.

source: རྐང་པར་ཕྱག་འཚལ་ཐལ་མོ་སྦྱར་ཏེ་འདུག །
en: They bowed at his feet, and sat there, palms together.

source: ཡབ་ཅིག་བདག་ཅག་མཆི་བ་གསན་དུ་གསོལ། །
en: “ ‘Dear Papa, here we are.
